{
  "settings-light-mode": "Modo claro",
  "settings-dark-mode": "Modo oscuro",

  "scroll-bar-home": "INICIO",
  "scroll-bar-ab-me": "SOBRE MÍ",
  "scroll-bar-projects": "PROYECTOS",
  "scroll-bar-socials": "REDES SOCIALES",

  "global-socials-title": "REDES SOCIALES",

  "info-box-greeting": "hola, soy",
  "info-box-role": "el programador mas versátil",
  "info-box-age": "17 años",
  "info-box-location": "vivo en Rumanía actualmente",
  "info-box-exp": "media década de experiencia",
  "info-box-goal": "mi enfoque es la versatilidad, haré cualquier tarea",
  "info-box-specialization": "mi especialidad es C++ y Lua",

  "info-box-socials-button": "CONTACTATAME",
  "info-box-cv-button": "DESCARGAR CV",
  "info-box-projects-button": "VER PROYECTOS",

  "cv-modal-title": "DESCARGAR CV",
  "cv-modal-subtitle": "Elige el idioma en que quieres el CV",
  "cv-modal-footer": "Espero que oiga de ti pronto!",

  "section-1-scroll-down": "BAJA",

  "about-me-title": "SOBRE MÍ",
  "about-me-description-top": "Empecé a programar a los 12 con juegos de Roblox; luego pasé a C++ y gráficos en C++, exploré C# y más (p. ej., Arduino) y por último me metí en Frontend y algo de backend (un bot de Discord en Python).",
  "about-me-description-bottom": "No ha sido fácil y aún no termina, pero la experiencia me enseñó que puedo llevar un proyecto de la idea al producto, aunque sea ambicioso o no conozca la tecnología, porque la aprendo rápido. Haré un proyecto y lo haré bien.",

  "section-2-lang-title": "IDIOMAS QUE SÉ",
  "section-2-eng-lang": "Inglés - Cerca de C2, casi nativo",
  "section-2-ro-lang": "Rumano - Mi lengua nativa",
  "section-2-es-lang": "Español - Decente; nací y viví 8 años aquí",

  "tech-title": "TECNOLOGÍAS",
  "tech-cpp-desc": "Usé C++ en mi proyecto Omni Bank Manager y probé a crear varios motores gráficos con él.",
  "tech-lua-desc": "Lua/Luau fue mi inicio; desde entonces me volví muy avanzado y conocedor a fondo del lenguaje.",
  "tech-web-desc": "He creado dos landing pages (no listadas aquí) con frontend puro (vanilla).",
  "tech-py-desc": "Usé Python para crear un bot de Discord de 20k+ líneas con discord.py, listado en mis proyectos.",
  "tech-vue-desc": "Este portafolio fue mi primer proyecto con Vue y TailwindCSS, frameworks que seguiré usando.",
  "tech-flutter-desc": "Estoy aprendiendo Flutter; lo usaré en concursos (sobre todo) y proyectos personales.",

  "projects-section-title": "PROYECTOS",
  "projects-card-view-more": "Ver más",

  "project-1-title": "INKED KNIGHT MISTERY",
  "project-1-card-desc": "IKM es un juego de Roblox, desarrollado solo por mí en 3–4 meses. Está ~80% completo y lo terminaré antes de fin de año.",
  "project-1-modal-desc": "IKM es un juego de Roblox en el que trabajé 3–4 meses, completamente solo. Se inspira en MM2, Mafia (juego de roles), Flicker y Among Us; aunque no salió aún, está muy cerca de terminarse y estará listo antes de fin de año.\n\nEs mi proyecto más ambicioso: casi todo lo desarrollé e implementé yo, de extremo a extremo: diseño UI, programación, modelado 3D, animación, marketing, logos y más. La mayor parte la hice en un solo verano.\n\nEl juego se divide en dos partes:\n• Lobby (tienda, inventario, desbloqueo de skins, progreso del pase, etc.)\n• Partida (lógica de juego, derrota/victoria, combate, etc.)\nEl lobby y partida comparten sistemas críticos: carga de skins, tienda cada 5 min (compras tanto en partida como en lobby), sistema de combate (probar skins en lobby), y más.\n\nEl bucle jugable combina misterio con deducción social. Implementé, entre otras, estas funciones:\n• Tienda que se reinicia cada 5 min y se sincroniza entre servidores.\n• Skins y desbloqueo + sistema de pase de batalla.\n• Inventario propio, pantalla de carga, leaderboard/lista de jugadores, etc.\n• Rankings globales y seguimiento de estadísticas.\n• Combate (bloqueo, energía, ataque, agachado).\n• Gestor completo de partidas (tareas, gestión de jugadores, identidades, votos, pistas, ocultar cuerpos, etc.).\n• Fuerte optimización: serialización, diseño inteligente (evitar replicación inútil), diseño orientado a datos, etc.\n• Bonos por jugar con amigos, economía completa, compras con Robux y monedas.\n• Jerarquía propia del código en \"Handlers\" para evitar framework y mantener modularidad.\n• Comunicación entre sistemas por señales en vez de llamadas directas, evitando dependencias circulares.\n• Plan de soporte para todas las plataformas (incluida VR).\netc.\n\nTecnologías principales:\n• Fusion (UI). También usé React en otros proyectos, pero lo dejé por que Fusion es mas versátil.\n• Signal\n• Lyra\n• Janitor\n• Promise\n• Rojo (usé Visual Studio Code como IDE; me resulta más versátil que el editor de Roblox)\n\nRetos:\n    • Implementé una verificación basada en hora del servidor para que todos los servidores elijan los mismos ítems en la tienda.\n    • Equilibré el rendimiento limitando la replicación y estructurando datos para una comunicación cliente-servidor eficiente.\n    • Diseñé una base de código modular para crecer sin depender de frameworks pesados.\n\nIKM me enseñó a manejar el ciclo completo de un juego multijugador: diseño de sistemas, optimización y pruebas. Me llevó a resolver sincronización compleja y a diseñar una arquitectura escalable, además de afinar UI, ingeniería de sistemas complejos y balance de economía.\n\nGracias a los testers por el feedback y la ayuda para afinar el juego.",

  "project-2-title": "HOOTY DISCORD BOT",
  "project-2-card-desc": "Hooty es un bot de Discord de ~20k LOC escrito en Python con discord.py. Nació para reemplazar la mayoría de bots grandes que usaba en mi servidor.",
  "project-2-modal-desc": "Hooty está pensado para desplegarse una vez y usarse en un solo servidor; no lo diseñé para multi-servidor. Tiene la mayoría de funciones de bots como MEE6, Dyno, Card-bot, etc. Se despliega con Docker y hoy alojo dos instancias: una para mi servidor Realm Roundtable (fan de The Owl House, donde el bot también se lanzó) y otra para el servidor del juego IKM. Usé Visual Studio Code como editor principal.\n\n    Funciones más importantes:\n    • Sistema de niveles propio: XP y progresión orientados al engagement.\n    • Moderación: advertencias, logs, kicks, bans, mutes, con registros persistentes.\n    • Reaction Roles: asignación de roles por emojis.\n    • Economía: moneda del servidor con recompensas y compras.\n    • Recompensas para boosters del servidor.\n    • Giveaways y eventos: gestión automática.\n    • Recordatorios de bump para impulsar el servidor.\n    etc.\n\n    Para la lista completa de funciones, revisa el repositorio en GitHub.\n\n    Retos:\n    • Diseñé un manejador de comandos modular para mantener el proyecto al crecer.\n    • Logging estructurado y manejo de errores para asegurar uptime.\n    • Gestión eficaz de tareas asíncronas y rate limits del API de Discord.\n    • Aprendí contenedores con Docker, despliegues automatizados vía Proxmox.\n\n    Lo que aprendí:\n    • Estructura de proyectos Python en una codebase grande.\n    • Mayor dominio de discord.py y programación asíncrona.\n    • Contenerización y despliegue con Docker.\n    • Administración de servidores con Ubuntu + Proxmox.\n    • Prácticas DevOps para operar múltiples instancias en vivo.\n\n   Resumiendo, Hooty me ayudó a mejorar Python y a ganar experiencia en gestión de servidores, seguridad y buenas prácticas para desarrollar aplicaciones DevOps.",

  "project-3-title": "OMNI BANK DATABASE MANAGER",
  "project-3-card-desc": "Omni Bank DB Manager es una app de escritorio en C++ hecha con Walnut (de TheCherno). Las bases de datos se guardan en un .txt local y tiene modo solo CMD.",
  "project-3-modal-desc": "Omni Bank DB Manager empezó como una app de consola en C++ asignada por el colegio. La amplié mucho más allá de lo pedido añadiendo:\n      • Interfaz gráfica completa con Dear ImGui y Walnut de TheCherno.\n      • Soporte multilenguaje (inglés y rumano).\n      • Modo dual: GUI por defecto y consola con el flag -noui.\n\n       El proyecto está explicado a fondo en el repositorio de GitHub, en inglés y rumano. La base de datos se guarda en un .txt local y se lee/escribe al abrir, guardar o cerrar. Usé Visual Studio 2022 como IDE.\n      Funciones más importantes:\n      • Modos UI y CMD\n      • Soporte de múltiples idiomas (inglés + rumano)\n      • Guardado y lectura automáticos de la base de datos\n      • Soporte para múltiples bases de datos\n\n       Lo que aprendí:\n        • Uso eficaz de ImGui para UI de aplicaciones reales.\n        • Uso de Walnut para agilizar desarrollo en C++.\n        • Implementación de multilenguaje en C++.\n        • Diseño y entrega de un software en C++ listo para usuarios.\n\n        Retos:\n        • Trabajé con STL más avanzada, como smart pointers, para evitar fugas.\n        • Implementé multilenguaje con un sistema flexible de recursos de texto, fácil de ampliar.\n        • Aseguré consistencia al leer/escribir .txt, manejando apagados inesperados y datos malformados.\n        • Equilibré GUI y CLI sin duplicar lógica, abstrayendo la funcionalidad del interfaz.\n        • Integré y adapté Walnut + ImGui en un proyecto no de juegos, salvando huecos de docs y aplicando técnicas de gamedev a software de escritorio.\n\n        Este proyecto fue un buen paso en mi camino con C++: me mostró cómo ir más allá de lo pedido, equilibrar usabilidad y rendimiento y elegir tecnología con criterio. Aunque aquí opté por ImGui + Walnut, estoy abierto y capacitado para aprender frameworks como Qt en futuros proyectos.",

  "project-4-title": "ESTE PORTAFOLIO",
  "project-4-card-desc": "Este portafolio es mi primer proyecto con Vue.js y TailwindCSS; lo hice en ~una semana.",
  "project-4-modal-desc": "Vue.js es mi framework web favorito por su sencillez, rendimiento y DX (puedo aprender otros, pero este es mi top). Aprendí Vue.js y Tailwind CSS en menos de una semana trabajando en este proyecto. Por falta de tiempo no vi cursos; fui directo a lo práctico sin experiencia previa.\n\n    Antes de este portafolio hice dos páginas estáticas con CSS, JS y HTML puros, usando solo swiper.js para sliders.\n• Landing para un proyecto fan de The Owl House (soy co-creador; inédita).\n• Sitio de portafolio para un electricista (privado por petición).\nAunque inéditos, esos trabajos me ayudaron a dominar rápido el frontend vanilla y fueron el paso previo para aprender Vue y Tailwind.\n\nConstruí este portafolio para presentarme y para el Hackathon 2025 de mi ciudad. Usé WebStorm como IDE (mi preferido), y también Visual Studio Code en las páginas estáticas previas.\n\nCaracterísticas:\n• Multilenguaje sin duplicar versiones\n• Tema claro/oscuro por accesibilidad y preferencia\n• Sistema de iconos propio con color/efectos dinámicos (SVG + CSS)\n• Optimizaciones para el sitio con efectos visuales pesados\n\nRetos y soluciones:\n• Integré código complejo de terceros (efectos de vue.bits) en un proyecto propio.\n• Superé retos de accesibilidad con selector de idioma y tema.\n• Aprendí a optimizar animaciones pesadas para fluidez en todos los dispositivos.\n\nLo que aprendí:\n• Adopción rápida de Vue.js y Tailwind CSS para web de nivel producción.\n• Landing pages escalables, accesibles y responsivas.\n• Autoaprendizaje efectivo bajo presión de tiempo.\n• Uso de IA como apoyo para aclarar conceptos y acelerar implementación.\n\nEste proyecto fue clave en mi carrera web: primera, pero no última, interacción con frameworks y librerías para apps completas. Me enamoré aún más de Vue y lo usaré en la mayoría de mis futuros proyectos.",

  "project-modal-socials": "Enlaces y redes",

  "section-4-education-title": "EDUCACIÓN",
  "section-4-education-text": "Bachillerato (último año) – Enfoque en Matemáticas e Informática. \n Aspirante a grado en Informática (programa en inglés) \n \n Autoaprendizaje (cursos de Udemy):",
  "section-4-education-l1": "Learn C++ de Abdul Bari",
  "section-4-education-l2": "DSA in C++ de Abdul Bari",
  "section-4-education-l3": "Flutter & Dart de Maximilian Schwarzmüller",

  "section-4-dp-title": "DIPLOMAS",

  "section-4-dp-1-title": "Olimpiada de Informática",
  "section-4-dp-1-desc": "Participé en la olimpiada de programación de mi condado (9º, 10º y 11º) y en 10º quedé en el top 10 de mi nivel.",
  "section-4-dp-2-title": "ITEC",
  "section-4-dp-2-desc": "Participé en la competencia ITEC en 9º, en la sección de DSA.",
  "section-4-dp-3-title": "Nextlab",
  "section-4-dp-3-desc": "Participé en la primera etapa de la competencia de robótica neXtlab y gané un kit de robótica.",
  "section-4-dp-4-title": "CPPI",
  "section-4-dp-4-desc": "Fui alumno 2 años en el Centro de rendimiento en informática de mi ciudad, con enfoque profundo en DSA.",
  "section-4-dp-5-title": "InfoCNFB",
  "section-4-dp-5-desc": "Participé en las competencias de InfoCNFB durante 3 años seguidos, organizadas por la universidad más prestigiosa de mi ciudad, y obtuve el 4.º lugar el primer año."
}